tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nextdns/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "xz"
brew "arm-none-eabi-gcc"
brew "autoconf"
brew "readline"
brew "sqlite"
brew "autojump"
brew "automake"
brew "coreutils"
brew "tcl-tk"
brew "expect"
brew "fd"
brew "unbound"
brew "srt"
brew "gh"
brew "gifski"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "helix"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libxslt"
brew "libyaml"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "ollama", restart_service: true
brew "p7zip"
brew "pandoc"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "stow"
brew "tidy-viewer"
brew "tmux"
brew "unixodbc"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "balance-lock"
cask "balenaetcher"
cask "bruno"
cask "cryptomator"
cask "dbngin"
cask "discord"
cask "docker"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "github"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "itsycal"
cask "jordanbaird-ice"
cask "kap"
cask "karabiner-elements"
cask "logseq"
cask "losslesscut"
cask "lunar"
cask "meetingbar"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "numi"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "qmk-toolbox"
cask "rapidapi"
cask "raycast"
cask "resilio-sync"
cask "shottr"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "tableplus"
cask "tailscale"
cask "transmit"
cask "typora"
cask "vial"
cask "visual-studio-code"
cask "wezterm"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zed"
cask "zoom"
