# --- Add repos --- 'brew tap'
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "federico-terzi/espanso"
tap "romkatv/powerlevel10k"

# set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true

# --- 'brew install'
brew "espanso"
brew "git"
brew "mas" #https://github.com/mas-cli/mas
brew "nvm" # node version manager
brew "pyenv" # python version management
brew "rbenv" # ruby version management
brew "sqlite"
brew "powerlevel10k" # zsh package/theme

# --- Mac App Store apps --- 'mas install'
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Compressor", id: 424390742
mas "Drafts", id: 1435957248
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Toggl Track", id: 957734279

# --- Brew Casks --- 'brew install --cask'
cask "1password"
# cask "a-better-finder-rename" # this is v11; I'm on 10
cask "ableton-live-suite10"
cask "adapter" # media converter
cask "authy"
cask "appcleaner"
cask "balenaetcher"
cask "codekit"
cask "cryptomator"
cask "firefox"
cask "focusrite-control"
cask "geotag"
cask "geotag-photos-pro"
cask "github"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "krisp"
cask "ledger-live"
cask "maccy" # clipboard manager
cask "musicbrainz-picard"
cask "muzzle" # silence notifications while screen sharing
cask "obinskit"
cask "obsidian"
cask "omnidisksweeper" # disk storage analyzer
cask "plexamp"
cask "private-internet-access"
cask "raycast"
cask "rectangle" # window management (open-source version of Magnet)
cask "resilio-sync"
cask "rocket" # emoji app
cask "sfdx"
cask "signal"
cask "sketch"
cask "slack"
cask "soundsource"
cask "spotify"
cask "typora"
cask "via" # QMK keyboard gui
cask "visual-studio-code"
cask "yacreader"
cask "zoom"
# --- drivers
cask "caldigit-thunderbolt-charging"
cask "focusrite-clarett-thunderbolt"
cask "logitech-g-hub"
cask "logitech-options"
# --- fonts
cask "font-inconsolata"
cask "font-fira-code"