# --- Add repos --- 'brew tap'
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "federico-terzi/espanso"

# --- 'brew install'
brew "git"
brew "espanso"
brew "gh"
brew "gifski"
brew "mas" #https://github.com/mas-cli/mas
brew "sqlite"
brew "coreutils"
brew "gnupg"

# --- Mac App Store apps --- 'mas install'
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Drafts", id: 1435957248
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696

# --- Brew Casks --- 'brew install --cask'

# --- BASE INSTALL ---
cask "1password"
cask "1password-cli"
cask "authy"
cask "appcleaner"
cask "cryptomator"
cask "firefox"
cask "github"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keepassxc"
cask "krisp"
cask "maccy" # clipboard manager
cask "microsoft-edge"
cask "muzzle" # silence notifications while screen sharing
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "omnidisksweeper" # disk storage analyzer
cask "pixel-picker"
cask "plexamp"
cask "raycast"
cask "rectangle" # window management (open-source version of Magnet)
cask "resilio-sync"
cask "rocket" # emoji app
cask "shottr"
cask "signal"
cask "soundsource"
cask "spotify"
cask "typora"
cask "via" # QMK keyboard gui
cask "visual-studio-code"
cask "zoom"
# --- drivers
cask "logitech-g-hub"
cask "logitech-options"

